In [1]:
import pandas as pd

In [2]:
data = [[0, 95, 100, 105], [1, 70, None, 80]]
products = pd.DataFrame(data, columns=['product_id', 'store1', 'store2', 'store3']).astype({'product_id':'Int64', 'store1':'Int64', 'store2':'Int64', 'store3':'Int64'})

In [3]:
products

   product_id  store1  store2  store3
0           0      95     100     105
1           1      70    <NA>      80

In [4]:
dat

[[0, 95, 100, 105], [1, 70, None, 80]]

In [5]:
products.melt(id_vars='product_id', var_name='store', value_name='price').dropna()

   product_id   store  price
0           0  store1     95
1           1  store1     70
2           0  store2    100
4           0  store3    105
5           1  store3     80